rails/toy_app/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    puts "hello world"
    puts User.all.class
    User.all.each do |u|
      puts u.name
    end
    puts User.all